jamesmunns/kinetis-rs/platform/CMSIS/Include/device/MK63F12/MK63F12_axbs.h
/*******************************************************************************
 * hw_axbs_t - module struct
 ******************************************************************************/
/*!
 * @brief All AXBS module registers.
 */
#pragma pack(1)
typedef struct _hw_axbs
{
    struct {
        __IO hw_axbs_prsn_t PRSn;          /*!< [0x0] Priority Registers Slave */
        uint8_t _reserved0[12];
        __IO hw_axbs_crsn_t CRSn;          /*!< [0x10] Control Register */
        uint8_t _reserved1[236];
    } SLAVE[5];
    uint8_t _reserved0[768];
    __IO hw_axbs_mgpcr0_t MGPCR0;          /*!< [0x800] Master General Purpose Control Register */
    uint8_t _reserved1[252];
    __IO hw_axbs_mgpcr1_t MGPCR1;          /*!< [0x900] Master General Purpose Control Register */
    uint8_t _reserved2[252];
    __IO hw_axbs_mgpcr2_t MGPCR2;          /*!< [0xA00] Master General Purpose Control Register */
    uint8_t _reserved3[252];
    __IO hw_axbs_mgpcr3_t MGPCR3;          /*!< [0xB00] Master General Purpose Control Register */
    uint8_t _reserved4[252];
    __IO hw_axbs_mgpcr4_t MGPCR4;          /*!< [0xC00] Master General Purpose Control Register */
    uint8_t _reserved5[252];
    __IO hw_axbs_mgpcr5_t MGPCR5;          /*!< [0xD00] Master General Purpose Control Register */
} hw_axbs_t;
#pragma pack()

/*! @brief Macro to access all AXBS registers. */
/*! @param x AXBS module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_AXBS(AXBS_BASE)</code>. */
#define HW_AXBS(x)     (*(hw_axbs_t *)(x))

#endif /* __HW_AXBS_REGISTERS_H__ */
/* EOF */
